xavi-oc/qemu/hw/dma/esp32s3_gdma.c
static bool esp32s3_gdma_write_guest(ESP32S3GdmaState *s, uint32_t addr, void* data, uint32_t len)
{
    MemTxResult res = dma_memory_write(&s->dma_as, addr, data, len, MEMTXATTRS_UNSPECIFIED);
    return res == MEMTX_OK;
}


/**
 * @brief Push current node (guest) address in the list of descriptors registers
 *
 * @param s GDMA state structure
 * @param chan Channel to update
 * @param chan Direction to update
 * @param current New node (guest) address to set as the current
 */
static void esp32s3_gdma_push_descriptor(ESP32S3GdmaState *s, uint32_t chan, uint32_t dir, uint32_t current)
{
    GdmaLinkedList next_node;
    uint32_t next = 0;
    DmaConfigState* state = &s->ch_conf[chan][dir];

    /* Assign the current descriptor address to the state register */
    state->state = current & R_DMA_OUT_STATE_CH0_OUTLINK_DSCR_ADDR_CH0_MASK;

    /* On real hardware, if the former address is incorrect, the current address is copied to this
     * register. */
    state->bfr_bfr_desc_addr = state->bfr_desc_addr;
    /* On real hardware, state->bfr_desc_addr is taken from state->desc_addr, even is `current` is valid */
    state->bfr_desc_addr = state->desc_addr;

    /* Get the next address out of the guest RAM */
    const bool valid = esp32s3_gdma_read_descr(s, current, &next_node);
    if (valid) {
        next = next_node.next_addr;
    }
    state->desc_addr = next;
}



/**
 * @brief Jump to the next node list and assign it to the given node
 *
 * @param s GDMA state structure
 * @param node Node to get the next neighbor of
 *
 * @returns true if the next node is valid, false else
 */
static inline bool esp32s3_gdma_next_list_node(ESP32S3GdmaState *s, uint32_t chan, uint32_t dir, GdmaLinkedList* node)
{
    const uint32_t current = node->next_addr;
    esp32s3_gdma_push_descriptor(s, chan, dir, current);
    return esp32s3_gdma_read_descr(s, current, node);
}


/**
 * @brief Get the first descriptor to process when a restart is requested.
 * We need to get the "next" node of the last one processed, which is in `desc_addr` register
 *
 * @param s GDMA state structure
 * @param chan Channel to restart
 * @param dir Direction (INT or OUT) to restart
 * @param out Filled with the output guest address
 */
static void esp32s3_gdma_get_restart_buffer(ESP32S3GdmaState *s, uint32_t chan, uint32_t dir, uint32_t* out)
{
    DmaConfigState* state = &s->ch_conf[chan][dir];
    // GdmaLinkedList* list = NULL;
    /* The next node to use is taken from state->state's lowest 18 bit. Append it to the DRAM address */
    const uint32_t dram_upper_bits = ESP32S3_GDMA_RAM_ADDR & (~R_DMA_OUT_STATE_CH0_OUTLINK_DSCR_ADDR_CH0_MASK);
    const uint32_t guest_addr = dram_upper_bits | FIELD_EX32(state->state, DMA_OUT_STATE_CH0, OUTLINK_DSCR_ADDR_CH0);

    *out = guest_addr;
}


/**
 * Check the header file for more info about this function
 */
bool esp32s3_gdma_get_channel_periph(ESP32S3GdmaState *s, GdmaPeripheral periph, int dir, uint32_t* chan)
{
    /* If the state, the peripheral or the direction is invalid, return directly */
    if (s == NULL || chan == NULL ||
        periph > GDMA_LAST || periph == GDMA_SPI3 || periph == GDMA_I2S1 || periph == GDMA_LCDCAM ||
        dir < 0 || dir >= ESP32S3_GDMA_CONF_COUNT)
    {
        return false;
    }

    /* Check all the channels of the GDMA */
    for (int i = 0; i < ESP32S3_GDMA_CHANNEL_COUNT; i++) {
        /* IN/OUT PERI registers have the same organization, can use any macro.
         * Look for the channel that was configured with the given peripheral. It must be marked as "started" too */
        if ( FIELD_EX32(s->ch_conf[i][dir].peripheral, DMA_IN_PERI_SEL_CH0, PERI_IN_SEL_CH0) == periph ||
             FIELD_EX32(s->ch_conf[i][dir].link, DMA_OUT_LINK_CH0, OUTLINK_START_CH0)) {

            *chan = i;
            return true;
        }
    }

    return false;
}


/**
 * @brief Read data from guest RAM pointed by the linked list configured in the given DmaConfigState index.
 *        `size` bytes will be read and stored in `buffer`.
 */
bool esp32s3_gdma_read_channel(ESP32S3GdmaState *s, uint32_t chan, uint8_t* buffer, uint32_t size)
{
    DmaConfigState* state = &s->ch_conf[chan][ESP32S3_GDMA_OUT_IDX];

    state->link &= R_DMA_OUT_LINK_CH0_OUTLINK_ADDR_CH0_MASK;

    /* Same goes for the status */
    esp32s3_gdma_clear_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT),   R_DMA_IN_INT_RAW_CH0_OUT_DONE_CH0_INT_RAW_MASK |
                                                                    R_DMA_IN_INT_RAW_CH0_OUT_EOF_CH0_INT_RAW_MASK);

    /* Get the guest DRAM address */
    uint32_t out_addr = ((ESP32S3_GDMA_RAM_ADDR >> 20) << 20) | FIELD_EX32(state->link, DMA_OUT_LINK_CH0, OUTLINK_ADDR_CH0);

    /* Boolean to mark whether we need to check the owner for in and out buffers */
    const bool owner_check_out = FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].conf1, DMA_OUT_CONF1_CH0, OUT_CHECK_OWNER_CH0);

    /* Boolean to mark whether the transmit (out) buffers must have their owner bit cleared here */
    const bool clear_out = FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].conf0, DMA_OUT_CONF0_CH0, OUT_AUTO_WRBACK_CH0);

    /* Pointer to the lists that will be browsed by the loop below */
    GdmaLinkedList out_list;

    /* Boolean to mark whether a descriptor error occurred during the transfer */
    bool valid = true;

    /* Set the current buffer (guest address) in the `desc_addr` register */
    valid = esp32s3_gdma_read_descr(s, out_addr, &out_list);
    esp32s3_gdma_push_descriptor(s, chan, ESP32S3_GDMA_OUT_IDX, out_addr);

    /* Check that the address is valid. If the owner must be checked, make sure owner is the DMA controller.
     * On the real hardware, both in and out are checked at the same time, so in case of an error, both bits
     * are set. Replicate the same behavior here. */
    if ( !valid || (owner_check_out && !out_list.config.owner) ) {
        esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
        return false;
    }

    /* Store the current number of bytes written to `buffer` parameter */
    uint32_t consumed = 0;
    bool exit_loop = false;
    bool error = false;

    while (!exit_loop && !error) {
        /* Calculate the number of bytes to read from the OUT channel */
        const uint32_t remaining = size - consumed;
        const uint32_t min = MIN(out_list.config.length, remaining);

        valid = esp32s3_gdma_read_guest(s, out_list.buf_addr, buffer + consumed, min);
        if (!valid) {
            esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
            error = true;
            break;
        }
        consumed += min;

