xavi-oc/qemu/hw/dma/esp32s3_gdma.c
        if (consumed == size) {
            exit_loop = true;
        }

        /* If we reached the end of the TX descriptor, we can jump to the next buffer */
        if (min == out_list.config.length) {

            /* Before jumping to the next node, clear the owner bit if needed */
            if (clear_out) {
                out_list.config.owner = 0;

                /* Write back the modified descriptor, should always be valid */
                valid = esp32s3_gdma_read_descr(s, out_addr, &out_list);
                assert(valid);
            }

            const bool eof_bit = out_list.config.suc_eof;

            /* Retrieve the next node  while updating the virtual guest address */
            out_addr = out_list.next_addr;
            valid = esp32s3_gdma_next_list_node(s, chan, ESP32S3_GDMA_OUT_IDX, &out_list);

            /* Only check the valid flag and the owner if we don't have to exit the loop*/
            if ( !exit_loop && (!valid || (owner_check_out && !out_list.config.owner)) ) {
                esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
                error = true;
            }

            /* If the EOF bit was set, the real controller doesn't stop the transfer, it simply
             * sets the status accordingly (and generates an interrupt if enabled) */
            if (eof_bit) {
                esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_EOF_CH0_INT_RAW_MASK |
                                                 R_DMA_IN_INT_RAW_CH0_OUT_TOTAL_EOF_CH0_INT_RAW_MASK);
            }
        }
    }

    /* Check if all the bytes were sent successfully */
    if (exit_loop && consumed != size) {
        /* TODO: which error should be triggered ?*/
        esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
        error = true;
    }

    if (!error) {
        /* Set the transfer as completed. EOF should have already been triggered within the loop */
        esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DONE_CH0_INT_RAW_MASK);
    }

    return !error;
}


/**
 * @brief Write data to the guest RAM pointed by the linked list configured in the given DmaConfigState index.
 *        `size` bytes from `buffer` will be written to guest machine's RAM.
 */
bool esp32s3_gdma_write_channel(ESP32S3GdmaState *s, uint32_t chan, uint8_t* buffer, uint32_t size)
{
    DmaConfigState* state = &s->ch_conf[chan][ESP32S3_GDMA_IN_IDX];

    /* Clear the (RE)START fields, i.e., only keep the link address */
    state->link &= R_DMA_OUT_LINK_CH0_OUTLINK_ADDR_CH0_MASK;

    /* Same goes for the status */
    esp32s3_gdma_clear_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DONE_CH0_INT_RAW_MASK  |
                                       R_DMA_IN_INT_RAW_CH0_IN_SUC_EOF_CH0_INT_RAW_MASK);

    /* Get highest 12 bits of the DRAM address */
    uint32_t in_addr = ((ESP32S3_GDMA_RAM_ADDR >> 20) << 20) | FIELD_EX32(state->link, DMA_IN_LINK_CH0, INLINK_ADDR_CH0);

    /* Boolean to mark whether we need to check the owner for in buffers */
    const bool owner_check_in = FIELD_EX32(state->conf1, DMA_IN_CONF1_CH0, IN_CHECK_OWNER_CH0);

    /* Pointer to the lists that will be browsed by the loop below */
    GdmaLinkedList in_list = { 0 };
    /* Boolean to mark whether a descriptor error occurred during the transfer */
    bool valid = true;

    valid = esp32s3_gdma_read_descr(s, in_addr, &in_list);
    esp32s3_gdma_push_descriptor(s, chan, ESP32S3_GDMA_IN_IDX, in_addr);

    if ( !valid || (owner_check_in && !in_list.config.owner) ) {
        esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_ERR_CH0_INT_RAW_MASK);
        return false;
    }

    /* Clear the number of bytes written to the "in" buffer and the owner */
    in_list.config.length = 0;

    uint32_t consumed = 0;
    bool exit_loop = false;
    bool error = false;

    while (!exit_loop && !error) {

        /* Calculate the number of bytes to write to the in channel */
        const uint32_t remaining = size - consumed;
        const uint32_t min = MIN(in_list.config.size, remaining);

        /* Perform the actual copy, the in buffer address will always be at the beginning because the data
         * to write to it are contiguous (`buffer` parameter) */
        valid = esp32s3_gdma_write_guest(s, in_list.buf_addr, buffer + consumed, min);
        if (!valid) {
            esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_ERR_CH0_INT_RAW_MASK);
            error = true;
        }

        /* Update the number of bytes written to the "in" buffer */
        in_list.config.length += min;
        consumed += min;

        if (size == consumed) {
            exit_loop = true;
        }

        /* If we reached the end of the "node", go to the next one */
        if (in_list.config.size == in_list.config.length) {
            /* Clear the owner bit, set the length to the maximum bytes readable */
            in_list.config.owner = 0;

            /* During peripheral-to-memory transfers, the eof bit is only used to set a status bit, and generate
             * an interrupt if enabled. If we still have bytes to send, we won't stop the transfer.
             * In all cases, reset this bit as it must be only set at the end of the buffer. */
            if (in_list.config.suc_eof) {
                in_list.config.suc_eof = 0;
                esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_SUC_EOF_CH0_INT_RAW_MASK);
            }

            /* Write back the IN node to guest RAM */
            valid = esp32s3_gdma_write_descr(s, in_addr, &in_list);
            assert(valid);

            /* Get the next virtual address before replacing the current list node content */
            const uint32_t next_addr = in_list.next_addr;

            /* Even if we have to exit the loop, we still have to push the next address to the descriptors stack */
            if (exit_loop) {
                esp32s3_gdma_push_descriptor(s, chan, ESP32S3_GDMA_IN_IDX, next_addr);
                break;
            }

            /* In the case where the transfer is finished, we should still fetch the next node,
             * but we should not override the current in_list variable as it is used outside the loop
             * to reset the owner and update the suc_eof flag */
            valid = esp32s3_gdma_next_list_node(s, chan, ESP32S3_GDMA_IN_IDX, &in_list);

            if (!valid || (owner_check_in && !in_list.config.owner)) {
                /* Check the validity of the next node if we have to continue the loop (transfer finished) */
                esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_ERR_CH0_INT_RAW_MASK);
                error = true;
            } else {
                /* Continue the loop normally, next RX descriptor set to current */
                in_list.config.length = 0;

                /* Update the current in guest address */
                in_addr = next_addr;
            }
        }
    }

    if (!error) {
        /* In all cases (error or not), let's set the End-of-list in the receiver */
        in_list.config.suc_eof = 1;
        in_list.config.owner = 0;

        valid = esp32s3_gdma_write_descr(s, in_addr, &in_list);
        assert(valid);

        /* And store the EOF RX descriptor GUEST address in the correct register.
         * This can be used in the ISR to know which buffer has just been processed. */
        state->suc_eof_desc_addr = in_addr;

