xavi-oc/qemu/hw/dma/esp32s3_gdma.c
        /* Set the transfer as completed for both the IN and OUT link */
        esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DONE_CH0_INT_RAW_MASK);
    }

    return !error;
}


/**
 * @brief Check if a memory-to-memory transfer can be started and start it if possible
 *
 * @param s GDMA state structure
 * @param chan Index of the channel
 */
static void esp32s3_gdma_check_and_start_mem_transfer(ESP32S3GdmaState *s, uint32_t chan)
{
    DmaConfigState* state = s->ch_conf[chan];
    /* Keep the distinction between start and restart because it influences the first descriptor to process */
    const bool in_start    = FIELD_EX32(state[ESP32S3_GDMA_IN_IDX].link, DMA_IN_LINK_CH0, INLINK_START_CH0)   ? true : false;
    const bool in_restart  = FIELD_EX32(state[ESP32S3_GDMA_IN_IDX].link, DMA_IN_LINK_CH0, INLINK_RESTART_CH0) ? true : false;
    const bool out_start   = FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].link, DMA_OUT_LINK_CH0, OUTLINK_START_CH0)   ? true : false;
    const bool out_restart = FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].link, DMA_OUT_LINK_CH0, OUTLINK_RESTART_CH0) ? true : false;

    /* A memory-to-memory transfer can be started if MEM_TRANS is enabled, OUTLINK_(RE)START is set
     * and INLINK_(RE)START is set */
    if (FIELD_EX32(state[ESP32S3_GDMA_IN_IDX].conf0, DMA_IN_CONF0_CH0, MEM_TRANS_EN_CH0)
        && (in_start  || in_restart)
        && (out_start || out_restart))
    {
        /* Clear the (RE)START fields, i.e., only keep the link address */
        state[ESP32S3_GDMA_OUT_IDX].link &= R_DMA_OUT_LINK_CH0_OUTLINK_ADDR_CH0_MASK;
        state[ESP32S3_GDMA_IN_IDX].link &= R_DMA_IN_LINK_CH0_INLINK_ADDR_CH0_MASK;
        /* Same goes for the status */
        esp32s3_gdma_clear_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), 
                                           R_DMA_IN_INT_RAW_CH0_IN_DONE_CH0_INT_RAW_MASK  |
                                           R_DMA_IN_INT_RAW_CH0_IN_SUC_EOF_CH0_INT_RAW_MASK);
        esp32s3_gdma_clear_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), 
                                           R_DMA_IN_INT_RAW_CH0_OUT_DONE_CH0_INT_RAW_MASK |
                                           R_DMA_IN_INT_RAW_CH0_OUT_EOF_CH0_INT_RAW_MASK  );

        /* Get highest 12 bits of the DRAM address */
        const uint32_t high = (ESP32S3_GDMA_RAM_ADDR >> 20) << 20;

        /* TODO: in an inlink, when burst mode is enabled, size and buffer address must be word-aligned. */
        /* If a start was performed, the first descriptor address to process is in DMA_OUT_LINK_CHn register,
         * if a restart was performed, the first buffer is the `next` node of `desc_addr` register */
        uint32_t out_addr = high;
        uint32_t in_addr = high;

        if (out_start) {
            out_addr |= FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].link, DMA_OUT_LINK_CH0, OUTLINK_ADDR_CH0);
        } else {
            esp32s3_gdma_get_restart_buffer(s, chan, ESP32S3_GDMA_OUT_IDX, &out_addr);
        }

        if (in_start) {
            in_addr |= FIELD_EX32(state[ESP32S3_GDMA_IN_IDX].link, DMA_IN_LINK_CH0, INLINK_ADDR_CH0);
        } else {
            esp32s3_gdma_get_restart_buffer(s, chan, ESP32S3_GDMA_IN_IDX, &in_addr);
        }

        /* Boolean to mark whether we need to check the owner for in and out buffers */
        const bool owner_check_out = FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].conf1, DMA_OUT_CONF1_CH0, OUT_CHECK_OWNER_CH0);
        const bool owner_check_in = FIELD_EX32(state[ESP32S3_GDMA_IN_IDX].conf1, DMA_IN_CONF1_CH0, IN_CHECK_OWNER_CH0);
        /* Boolean to mark whether the transmit (out) buffers must have their owner bit cleared here */
        const bool clear_out = FIELD_EX32(state[ESP32S3_GDMA_OUT_IDX].conf0, DMA_OUT_CONF0_CH0, OUT_AUTO_WRBACK_CH0);

        /* Pointer to the lists that will be browsed by the loop below */
        GdmaLinkedList out_list = { 0 };
        GdmaLinkedList in_list = { 0 };
        /* Boolean to mark whether a descriptor error occurred during the transfer */
        bool valid = true;
        bool error = false;

        /* Get the content of the descriptor located at guest address out_addr */
        valid = esp32s3_gdma_read_descr(s, out_addr, &out_list);
        esp32s3_gdma_push_descriptor(s, chan, ESP32S3_GDMA_OUT_IDX, out_addr);

        /* Check that the address is valid. If the owner must be checked, make sure owner is the DMA controller.
         * On the real hardware, both in and out are checked at the same time, so in case of an error, both bits
         * are set. Replicate the same behavior here. */
        if ( !valid || (owner_check_out && !out_list.config.owner) ) {
            /* In case of an error, go directly to the next node (as the C3 hardware does) */
            esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
            error = true;
        }

        valid = esp32s3_gdma_read_descr(s, in_addr, &in_list);
        esp32s3_gdma_push_descriptor(s, chan, ESP32S3_GDMA_IN_IDX, in_addr);

        if ( !valid || (owner_check_in && !in_list.config.owner) ) {
            esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_ERR_CH0_INT_RAW_MASK);
            error = true;
        }

        /* If any of the error bit has been set, return directly */
        if (error) {
            return;
        }

        /* Clear the number of bytes written to the "in" buffer and the owner */
        in_list.config.length = 0;

        /* Number of bytes remaining in the current "out" buffer */
        uint32_t remaining = out_list.config.length;
        /* Store the current number of bytes consumed in the "out" buffer */
        uint32_t consumed = 0;

        bool exit_loop = false;

        /* Allocate a temporary buffer big enough to store any descriptor data */
        void* tmp_buffer = g_malloc(4096 * sizeof(uint8_t));
        if (tmp_buffer == NULL) {
            error_report("[GDMA] No more memory in host\n");
            return;
        }

        while (!exit_loop && !error) {

            /* Calculate the number of bytes to send to the in channel */
            const uint32_t min = MIN(in_list.config.size, out_list.config.length);

            /* Perform the actual copy, for the same reasons as stated above, use the error boolean */
            valid = esp32s3_gdma_read_guest(s, out_list.buf_addr + consumed, tmp_buffer, min);
            if (!valid) {
                esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
                error = true;
            }
            valid = esp32s3_gdma_write_guest(s, in_list.buf_addr + in_list.config.length, tmp_buffer, min);
            if (!valid) {
                esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_ERR_CH0_INT_RAW_MASK);
                error = true;
            }

            /* Update the number of bytes written to the "in" buffer */
            in_list.config.length += min;
            consumed += min;

            /* Even if we reached the end of the TX descriptor, we still have to update RX descriptors
             * and registers, use `exit_loop` instead of break or return */
            /* If we don't have any more bytes in the "out" buffer, we can skip to the next buffer */
            if (remaining == consumed) {
                /* Before jumping to the next node, clear the owner bit */
                if (clear_out) {
                    out_list.config.owner = 0;
                    /* Write back the modified descriptor, should always be valid */
                    valid = esp32s3_gdma_write_descr(s, out_addr, &out_list);
                    assert(valid);
                }
                exit_loop = out_list.config.suc_eof ? true : false;

                const uint32_t next_addr = out_list.next_addr;
                valid = esp32s3_gdma_next_list_node(s, chan, ESP32S3_GDMA_OUT_IDX, &out_list);

                /* Only check the valid flag and the owner if we don't have to exit the loop*/
                if ( !exit_loop && (!valid || (owner_check_out && !out_list.config.owner)) ) {
                    esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_OUT_DSCR_ERR_CH0_INT_RAW_MASK);
                    error = true;
                } else {
                    /* Update "remaining" with the number of bytes to transfer from the new buffer */
                    out_addr = next_addr;
                    remaining = out_list.config.length;
                    consumed = 0;
                }
            }


