xavi-oc/qemu/hw/dma/esp32s3_gdma.c
            /* If we reached the end of the "node", go to the next one */
            if (in_list.config.size == in_list.config.length) {

                in_list.config.owner = 0;

                /* Write back the IN node to guest RAM */
                valid = esp32s3_gdma_write_descr(s, in_addr, &in_list);
                assert(valid);

                /* Check that we do have more "in" buffers, if that's not the case, raise an error..
                 * TODO: Check if the behavior is the same as Peripheral-to-Memory transfers, where
                 * this bit is only used to generate and interrupt. */
                if (!exit_loop && in_list.config.suc_eof) {
                    esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_EMPTY_CH0_INT_RAW_MASK);
                    error = true;
                    break;
                }

                const uint32_t next_addr = in_list.next_addr;

                /* In the case where the transfer is finished, we should still "push" the next node
                 * to our descriptors stack, but we should not modify the structure itself as we will
                 * reset the owner and update the suc_eof flag */
                if (exit_loop) {
                    esp32s3_gdma_push_descriptor(s, chan, ESP32S3_GDMA_IN_IDX, next_addr);
                    break;
                }

                /* We have to continue the loop, so fetch the next node, it will also update the descriptors stack */
                valid = esp32s3_gdma_next_list_node(s, chan, ESP32S3_GDMA_IN_IDX, &in_list);

                /* Check the validity of the next node if we have to continue the loop (transfer finished) */
                if (!valid || (owner_check_in && !in_list.config.owner)) {
                    esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), R_DMA_IN_INT_RAW_CH0_IN_DSCR_ERR_CH0_INT_RAW_MASK);
                    error = true;
                } else {
                    /* Continue the loop normally, next RX descriptor set to current */
                    in_list.config.length = 0;

                    /* Update the current in guest address */
                    in_addr = next_addr;
                }
            }

        }

        if (!error) {
            /* In all cases (error or not), let's set the End-of-list in the receiver */
            in_list.config.suc_eof = 1;
            in_list.config.owner = 0;

            /* Write back the previous changes */
            valid = esp32s3_gdma_write_descr(s, in_addr, &in_list);
            assert(valid);

            /* And store the EOF RX descriptor GUEST address in the correct register.
             * This can be used in the ISR to know which buffer has just been processed. */
            state[ESP32S3_GDMA_IN_IDX].suc_eof_desc_addr = in_addr;

            /* Set the transfer as completed for both the IN and OUT link */
            esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_IN_IDX*ESP32S3_GDMA_CHANNEL_COUNT), 
                                             R_DMA_IN_INT_RAW_CH0_IN_DONE_CH0_INT_RAW_MASK  |
                                             R_DMA_IN_INT_RAW_CH0_IN_SUC_EOF_CH0_INT_RAW_MASK);
            esp32s3_gdma_set_status(s, (chan + ESP32S3_GDMA_OUT_IDX*ESP32S3_GDMA_CHANNEL_COUNT), 
                                             R_DMA_IN_INT_RAW_CH0_OUT_DONE_CH0_INT_RAW_MASK |
                                             R_DMA_IN_INT_RAW_CH0_OUT_EOF_CH0_INT_RAW_MASK);
        }

        g_free(tmp_buffer);
    }
}



/**
 * @brief Check whether the given register offset corresponds to a read-only register
 *
 * @param offset Offset of the register in DmaConfigState structure, in bytes
 *
 * @return true is the register is read-only, false else
 */
static bool esp32s3_gdma_register_read_only(uint32_t offset)
{
    return offset >= offsetof(DmaConfigState, state) && offset < offsetof(DmaConfigState, priority);
}


/**
 * @brief Function called when a configuration register was written to
 *
 * @param s GDMA state structure
 * @param chan Index of the channel to be written
 * @param in_out Index of the sub-channel, which is ESP32S3_GDMA_IN_IDX or ESP32S3_GDMA_OUT_IDX
 * @param addr_in_block Address in bytes of the register being written to in the block
 * @param value 32-bit value being written to the register
 */
static void esp32s3_gdma_write_chan_conf(ESP32S3GdmaState *s, uint32_t chan, uint32_t in_out,
                                         uint32_t addr_in_block, uint32_t value)
{
    DmaConfigState* state = &s->ch_conf[chan][in_out];
    uint32_t* const reg_addr = (uint32_t*) ((uint8_t*) state + addr_in_block);

    /* Dereference the former value of the register being written to */
    const uint32_t former = *reg_addr;

    /* Write the new value to the register if not read-only! */
    if (!esp32s3_gdma_register_read_only(addr_in_block)) {
        *reg_addr = value;
    }

    /* We will only support a subset of GDMA registers for now. To add support for more registers,
     * the following snippet can be update */
    uint32_t start_mask = 0;
    uint32_t restart_mask = 0;
    switch(addr_in_block) {

        /* No matter the channel and in/out direction, the registers are organized the same way,
         * so we can use the macros for any channel */
        case offsetof(DmaConfigState, conf0):
            /* Check the reset bit, call the reset function on negative edge */
            if (FIELD_EX32(value,  DMA_IN_CONF0_CH0, IN_RST_CH0) == 0 &&
                FIELD_EX32(former, DMA_IN_CONF0_CH0, IN_RST_CH0) != 0)
            {
                esp32s3_gdma_reset_fifo(s, chan, in_out);
            }
            /* Check if memory transfer has just been enabled (only valid for IN channels) */
            if (in_out == ESP32S3_GDMA_IN_IDX &&
                FIELD_EX32(value,  DMA_IN_CONF0_CH0, MEM_TRANS_EN_CH0))
            {
                esp32s3_gdma_check_and_start_mem_transfer(s, chan);
            }
            break;

        case offsetof(DmaConfigState, link):
            /* For IN and OUT, the START bit is not at the same offset, so we need to test both separately */
            start_mask = ESP32S3_GDMA_IN_IDX ? R_DMA_IN_LINK_CH0_INLINK_START_CH0_MASK : R_DMA_OUT_LINK_CH0_OUTLINK_START_CH0_MASK;
            restart_mask = ESP32S3_GDMA_IN_IDX ? R_DMA_IN_LINK_CH0_INLINK_RESTART_CH0_MASK : R_DMA_OUT_LINK_CH0_OUTLINK_RESTART_CH0_MASK;

