xavi-oc/qemu/hw/dma/esp32s3_gdma.c
            /* Check if any of the previous two bits has just been enabled */
            if ((value & start_mask) || (value & restart_mask))
            {
                esp32s3_gdma_check_and_start_mem_transfer(s, chan);
            }

        default:
            break;
    }
}


static void esp32s3_gdma_write(void *opaque, hwaddr addr,
                              uint64_t value, unsigned int size)
{
    ESP32S3GdmaState *s = ESP32S3_GDMA(opaque);

#if GDMA_DEBUG
    info_report("[GDMA] Writing to %08lx (%08lx)", addr, value);
#endif

    switch(addr) {
        case A_DMA_IN_INT_RAW_CH0 ... A_DMA_IN_INT_CLR_CH0:
            esp32s3_gdma_write_int_state(s,
                                         0,
                                         addr - A_DMA_IN_INT_RAW_CH0,
                                         value);
            break;
        case A_DMA_IN_INT_RAW_CH1 ... A_DMA_IN_INT_CLR_CH1:
            esp32s3_gdma_write_int_state(s,
                                         1,
                                         addr - A_DMA_IN_INT_RAW_CH1,
                                         value);
            break;
        case A_DMA_IN_INT_RAW_CH2 ... A_DMA_IN_INT_CLR_CH2:
            esp32s3_gdma_write_int_state(s,
                                         2,
                                         addr - A_DMA_IN_INT_RAW_CH2,
                                         value);
            break;
        case A_DMA_IN_INT_RAW_CH3 ... A_DMA_IN_INT_CLR_CH3:
            esp32s3_gdma_write_int_state(s,
                                         3,
                                         addr - A_DMA_IN_INT_RAW_CH3,
                                         value);
            break;
        case A_DMA_IN_INT_RAW_CH4 ... A_DMA_IN_INT_CLR_CH4:
            esp32s3_gdma_write_int_state(s,
                                         4,
                                         addr - A_DMA_IN_INT_RAW_CH4,
                                         value);
            break;
        case A_DMA_OUT_INT_RAW_CH0 ... A_DMA_OUT_INT_CLR_CH0:
            esp32s3_gdma_write_int_state(s,
                                         5,
                                         addr - A_DMA_OUT_INT_RAW_CH0,
                                         value);
            break;
        case A_DMA_OUT_INT_RAW_CH1 ... A_DMA_OUT_INT_CLR_CH1:
            esp32s3_gdma_write_int_state(s,
                                         6,
                                         addr - A_DMA_OUT_INT_RAW_CH1,
                                         value);
            break;
        case A_DMA_OUT_INT_RAW_CH2 ... A_DMA_OUT_INT_CLR_CH2:
            esp32s3_gdma_write_int_state(s,
                                         7,
                                         addr - A_DMA_OUT_INT_RAW_CH2,
                                         value);
            break;
        case A_DMA_OUT_INT_RAW_CH3 ... A_DMA_OUT_INT_CLR_CH3:
            esp32s3_gdma_write_int_state(s,
                                         8,
                                         addr - A_DMA_OUT_INT_RAW_CH3,
                                         value);
            break;
        case A_DMA_OUT_INT_RAW_CH4 ... A_DMA_OUT_INT_CLR_CH4:
            esp32s3_gdma_write_int_state(s,
                                         9,
                                         addr - A_DMA_OUT_INT_RAW_CH4,
                                         value);
            break;

        case A_DMA_MISC_CONF:
            s->misc_conf = value;
            break;

        case A_DMA_IN_CONF0_CH0 ... A_DMA_IN_CONF1_CH0:
        case A_DMA_INFIFO_STATUS_CH0 ... A_DMA_IN_PERI_SEL_CH0:
            esp32s3_gdma_write_chan_conf(s, 0, ESP32S3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH0, value);
            break;
        case A_DMA_OUT_CONF0_CH0 ... A_DMA_OUT_CONF1_CH0:
        case A_DMA_OUTFIFO_STATUS_CH0 ... A_DMA_OUT_PERI_SEL_CH0:
            esp32s3_gdma_write_chan_conf(s, 0, ESP32S3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH0, value);
            break;

        case A_DMA_IN_CONF0_CH1 ... A_DMA_IN_CONF1_CH1:
        case A_DMA_INFIFO_STATUS_CH1 ... A_DMA_IN_PERI_SEL_CH1:
            esp32s3_gdma_write_chan_conf(s, 1, ESP32S3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH1, value);
            break;
        case A_DMA_OUT_CONF0_CH1 ... A_DMA_OUT_CONF1_CH1:
        case A_DMA_OUTFIFO_STATUS_CH1 ... A_DMA_OUT_PERI_SEL_CH1:
            esp32s3_gdma_write_chan_conf(s, 1, ESP32S3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH1, value);
            break;

        case A_DMA_IN_CONF0_CH2 ... A_DMA_IN_CONF1_CH2:
        case A_DMA_INFIFO_STATUS_CH2 ... A_DMA_IN_PERI_SEL_CH2:
            esp32s3_gdma_write_chan_conf(s, 2, ESP32S3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH2, value);
            break;
        case A_DMA_OUT_CONF0_CH2 ... A_DMA_OUT_CONF1_CH2:
        case A_DMA_OUTFIFO_STATUS_CH2 ... A_DMA_OUT_PERI_SEL_CH2:
            esp32s3_gdma_write_chan_conf(s, 2, ESP32S3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH2, value);
            break;

        case A_DMA_IN_CONF0_CH3 ... A_DMA_IN_CONF1_CH3:
        case A_DMA_INFIFO_STATUS_CH3 ... A_DMA_IN_PERI_SEL_CH3:
            esp32s3_gdma_write_chan_conf(s, 3, ESP32S3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH3, value);
            break;
        case A_DMA_OUT_CONF0_CH3 ... A_DMA_OUT_CONF1_CH3:
        case A_DMA_OUTFIFO_STATUS_CH3 ... A_DMA_OUT_PERI_SEL_CH3:
            esp32s3_gdma_write_chan_conf(s, 3, ESP32S3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH3, value);
            break;

        case A_DMA_IN_CONF0_CH4 ... A_DMA_IN_CONF1_CH4:
        case A_DMA_INFIFO_STATUS_CH4 ... A_DMA_IN_PERI_SEL_CH4:
            esp32s3_gdma_write_chan_conf(s, 4, ESP32S3_GDMA_IN_IDX, addr - A_DMA_IN_CONF0_CH4, value);
            break;
        case A_DMA_OUT_CONF0_CH4 ... A_DMA_OUT_CONF1_CH4:
        case A_DMA_OUTFIFO_STATUS_CH4 ... A_DMA_OUT_PERI_SEL_CH4:
            esp32s3_gdma_write_chan_conf(s, 4, ESP32S3_GDMA_OUT_IDX, addr - A_DMA_OUT_CONF0_CH4, value);
            break;
        default:
#if GDMA_WARNING
            warn_report("[GDMA] Unsupported write to %08lx (%08lx)", addr, value);
#endif
            break;
    }

