xavi-oc/qemu/hw/dma/esp32s3_gdma.c
}

static const MemoryRegionOps esp32s3_gdma_ops = {
    .read =  esp32s3_gdma_read,
    .write = esp32s3_gdma_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};


static Property esp32s3_gdma_properties[] = {
    DEFINE_PROP_LINK("soc_mr", ESP32S3GdmaState, soc_mr, TYPE_MEMORY_REGION, MemoryRegion*),
    DEFINE_PROP_END_OF_LIST(),
};


static void esp32s3_gdma_reset(DeviceState *dev)
{
    ESP32S3GdmaState *s = ESP32S3_GDMA(dev);
    memset(s->ch_int, 0, sizeof(s->ch_int));
    memset(s->ch_conf, 0, sizeof(s->ch_conf));
    s->misc_conf = 0;

    /* Set the FIFOs as empty */
    for (int i = 0; i < ESP32S3_GDMA_CHANNEL_COUNT; i++) {
        qemu_irq_lower(s->irq[i]);
        qemu_irq_lower(s->irq[i + ESP32S3_GDMA_CHANNEL_COUNT]);

        for (int j = 0; j < ESP32S3_GDMA_CONF_COUNT; j++) {
            esp32s3_gdma_reset_fifo(s, i, j);
        }
    }

}


static void esp32s3_gdma_realize(DeviceState *dev, Error **errp)
{
    ESP32S3GdmaState *s = ESP32S3_GDMA(dev);

    /* Make sure the DRAM MemoryRegion was set */
    assert(s->soc_mr != NULL);

    address_space_init(&s->dma_as, s->soc_mr, "esp32s3.gdma");
}


static void esp32s3_gdma_init(Object *obj)
{
    ESP32S3GdmaState *s = ESP32S3_GDMA(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32s3_gdma_ops, s,
                          TYPE_ESP32S3_GDMA, ESP32S3_GDMA_REGS_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);

    for (int i = 0; i < ESP32S3_GDMA_CHANNEL_COUNT*2; i++) {
        sysbus_init_irq(sbd, &s->irq[i]);
    }

    esp32s3_gdma_reset((DeviceState*) s);
}


static void esp32s3_gdma_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = esp32s3_gdma_reset;
    dc->realize = esp32s3_gdma_realize;
    device_class_set_props(dc, esp32s3_gdma_properties);
}

static const TypeInfo esp32s3_gdma_info = {
        .name = TYPE_ESP32S3_GDMA,
        .parent = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(ESP32S3GdmaState),
        .instance_init = esp32s3_gdma_init,
        .class_init = esp32s3_gdma_class_init
};

static void esp32s3_gdma_register_types(void)
{
    type_register_static(&esp32s3_gdma_info);
}

type_init(esp32s3_gdma_register_types)
